#include "typedefine.h"
#include  "iodefine.h"
#include "misratypes.h"
#include "thermocouple.h"
#include "dsad.h"

// 熱電対用
#define D_TC_TABLE_TOP_TEMPARATURE  (-20.0F)    // 熱起電力テーブルの先頭データ[uV]が示す温度[℃]
#define D_TC_TABLE_SIZE             (420)       // 熱起電力テーブルのデータ数　(-20～399℃)


// 基準接点用(RTD Pt100)
#define D_RTD_TABLE_TOP_TEMPARATURE (0.0)    // 基準接点補償用テーブルの先頭データに対応する温度[℃]       
#define D_RTD_TABLE_SIZE            (50)     // 基準接点補償用テーブルのデータ数


// 熱電対( K タイプ) 熱起電力表　(単位:[uV])
//  温度 -10～399℃  (1℃毎)
//
// 読み方: -10℃ = -392 [uV]
//           0℃ =  0   [uV]
//           9℃ = 357  [uV]
//

static const float s_tc_table[] =
{
 -778, -739, -701, -663, -624, -586, -547, -508, -470, -431,   // -20～-11℃
 -392, -353, -314, -275, -236, -197, -157, -118,  -79,  -39,   // -10～-1 ℃
    0,   39,   79,  119,  158,  198,  238,  277,  317,  357,   //  0～  9 ℃
  397,  437,  477,  517,  557,  597,  637,  677,  718,  758,   // 10～ 19 ℃
  798,  838,  879,  919,  960, 1000, 1041, 1081, 1122, 1163,   // 20～ 29 ℃
 1203, 1244, 1285, 1326, 1366, 1407, 1448, 1489, 1530, 1571,   // 30～ 39 ℃
 1612, 1653, 1694, 1735, 1776, 1817, 1858, 1899, 1941, 1982,   // 40～ 49 ℃
 2023, 2064, 2106, 2147, 2188, 2230, 2271, 2312, 2354, 2395,   // 50～ 59 ℃
 2436, 2478, 2519, 2561, 2602, 2644, 2685, 2727, 2768, 2810,   // 60～ 69 ℃
 2851, 2893, 2934, 2976, 3017, 3059, 3100, 3142, 3184, 3225,   // 70～ 79 ℃
 3267, 3308, 3350, 3391, 3433, 3474, 3516, 3557, 3599, 3640,   // 80～ 89 ℃
 3682, 3723, 3765, 3806, 3848, 3889, 3931, 3972, 4013, 4055,   // 90～ 99 ℃
 4096, 4138, 4179, 4220, 4262, 4303, 4344, 4385, 4427, 4468,   // 100～ 109 ℃
 4509, 4550, 4591, 4633, 4674, 4715, 4756, 4797, 4838, 4879,   // 110～ 119 ℃
 4920, 4961, 5002, 5043, 5084, 5124, 5165, 5206, 5247, 5288,   // 120～ 129 ℃
 5328, 5369, 5410, 5450, 5491, 5532, 5572, 5613, 5653, 5694,   // 130～ 139 ℃
 5735, 5775, 5815, 5856, 5896, 5937, 5977, 6017, 6058, 6098,   // 140～ 149 ℃
 6138, 6179, 6219, 6259, 6299, 6339, 6380, 6420, 6460, 6500,   // 150～ 159 ℃
 6540, 6580, 6620, 6660, 6701, 6741, 6781, 6821, 6861, 6901,   // 160～ 169 ℃
 6941, 6981, 7021, 7060, 7100, 7140, 7180, 7220, 7260, 7300,   // 170～ 179 ℃
 7340, 7380, 7420, 7460, 7500, 7540, 7579, 7619, 7659, 7699,   // 180～ 189 ℃
 7739, 7779, 7819, 7859, 7899, 7939, 7979, 8019, 8059, 8099,   // 190～ 199 ℃
 8138, 8178, 8218, 8258, 8298, 8338, 8378, 8418, 8458, 8499,   // 200～ 209 ℃
 8539, 8579, 8619, 8659, 8699, 8739, 8779, 8819, 8860, 8900,   // 210～ 219 ℃
 8940, 8980, 9020, 9061, 9101, 9141, 9181, 9222, 9262, 9302,   // 220～ 229 ℃
 9343, 9383, 9423, 9464, 9504, 9545, 9585, 9626, 9666, 9707,   // 230～ 239 ℃
 9747, 9788, 9828, 9869, 9909, 9950, 9991,10031,10072,10113,   // 240～ 249 ℃
10153,10194,10235,10276,10316,10357,10398,10439,10480,10520,   // 250～ 259 ℃
10561,10602,10643,10684,10725,10766,10807,10848,10889,10930,   // 260～ 269 ℃
10971,11012,11053,11094,11135,11176,11217,11259,11300,11341,   // 270～ 279 ℃
11382,11423,11465,11506,11547,11588,11630,11671,11712,11753,   // 280～ 289 ℃
11795,11836,11877,11919,11960,12001,12043,12084,12126,12167,   // 290～ 299 ℃
12209,12250,12291,12333,12374,12416,12457,12499,12540,12582,   // 300～ 309 ℃
12624,12665,12707,12748,12790,12831,12873,12915,12956,12998,   // 310～ 319 ℃
13040,13081,13123,13165,13206,13248,13290,13331,13373,13415,   // 320～ 329 ℃
13457,13498,13540,13582,13624,13665,13707,13749,13791,13833,   // 330～ 339 ℃
13874,13916,13958,14000,14042,14084,14126,14167,14209,14251,   // 340～ 349 ℃
14293,14335,14377,14419,14461,14503,14545,14587,14629,14671,   // 350～ 359 ℃
14713,14755,14797,14839,14881,14923,14965,15007,15049,15091,   // 360～ 369 ℃
15133,15175,15217,15259,15301,15343,15385,15427,15469,15511,   // 370～ 379 ℃
15554,15596,15638,15680,15722,15764,15806,15849,15891,15933,   // 380～ 389 ℃
15975,16017,16059,16102,16144,16186,16228,16270,16313,16355    // 390～ 399 ℃
};

// 
// 基準接点補償用のRTD Pt100 (PTS060301B100RP100)の、抵抗値と温度 (IEC60751) (JIS C1604)
// 温度範囲 0～49　℃　(1℃毎)
//
//   読み方:  0℃ = 100 Ω 
//            10℃ =103.903 Ω
//
static const float rtd_pt100_table[] =
{	
	100.000,100.391,100.781,101.172,101.562,101.953,102.343,102.733,103.123,103.513,   // 0～9 ℃ 		
	103.903,104.292,104.682,105.071,105.460,105.849,106.238,106.627,107.016,107.405,   // 10～19℃
	107.794,108.182,108.570,108.959,109.347,109.735,110.123,110.510,110.898,111.286,   // 20～29℃
	111.673,112.060,112.447,112.835,113.221,113.608,113.995,114.382,114.768,115.155,   // 30～39℃
	115.541,115.927,116.313,116.699,117.085,117.470,117.856,118.241,118.627,119.012    // 40～49℃
	 
};

float cj_reg;	       // 基準(零)接点補償用の抵抗値 [Ω]
float cj_temp;         // 基準(零)接点の温度 [℃]
float cj_mvol;         // 基準(零)接点の熱起電力 [uV]

float tc_mvol[4];	// 熱電対の熱起電力[uV]
float act_mvol[4];      // 基準接点補償後の熱起電力[uV]

float tc_temp[4];	// 熱電対による測定温度[℃]



// 　熱電対の温度計算
void tc_temp_cal()
{
	uint32_t i; 
	
	temp_cold_junction();	// 基準接点の温度(cj_temp)を得る
	   
	cj_mvol = temp_to_thermal_motiveforce(cj_temp); // 基準接点の熱起電力[uV]
	
	
	for ( i = 0 ; i < 4; i++ ) {
	    tc_mvol[i] = tc_thermal_motiveforce(ad_ch_avg[i]);	// 熱電対の熱起電力[uV]
	
            act_mvol[i] = cj_mvol + tc_mvol[i];		// 基準接点補償
	
	    tc_temp[i] = thermal_motiveforce_to_temp(act_mvol[i]);   // 温度計算
	}
	
}


//  基準接点の温度計算(零接点補償)　(RTD Pt100 使用)
// 
//  1)抵抗値の求め方
//    
//  リファレンス抵抗(Rref = 4.99 KΩ)にかかる電圧を、ADコンバータの基準電圧(Vref)としている。このため、Vrefは、
//   Vref = IEXC0 * Rref --- ①    (IEXC0:励起電流 500 uA)
//  基準接点補償抵抗(RTD1)にかかる電圧(Vin)は、
//   Vin = IEXC0 * RTD1    --- ②
//  また、DSAD1のA/D変換データ(ad1_ch0_avg)より、Vinは   
//   Vin = ((Vref * 2) / Gain) * ( ad1_ch0_avg / (2^24 )  --- ③
//   (RX23E-A ユーザーズマニュアル　ハードウェア編 34.3.5 DSAD への入力電圧とA/D 変換結果 (1)2の補数形式の場合 DADへの入力電圧)

//  ①式と②式を、③式に代入すると、
// IEXC0 * RTD1 = ((IEXC * Rref * 2 )/Gain) * (ad1_ch0_avg / (2^24) )
//  RTD1 =  ((Rref * 2)/Gain) * ( ad1_ch0_avg / (2^24) )
//    	 =   (Rref/Gain) * ( ad1_ch0_avg / 2^23 )  --- ④
//
//  得られるA/Dカウント値(RTDの電圧)は、RTDとRrefの比で決まり、IEXC0の影響を受けない。
// レシオメトリック測定と呼ばれている。
// (2^24 = 16,777,216 ,  2^23 = 8,388,608 , 2^23 - 1 =  8,388,607 )
//
//  ④式に数値を代入 
//   Rref = 4.99 KΩ , Gain = 32,  2^23 - 1 =  8,388,607 
//   RTD1 = (4990 / 32 ) * ( ad1_ch0_avg )/ 8,388,607 
//        =  (4990 / ( 32 * 8,388,607 )) * ad1_ch0_avg  , 4990/32 = 155.9375, 155.9367/8,388,607 = 1.85892e-5
//        =  1.85892e-5f * ad1_ch0_avg
// 補足:
//  a) バイナリ形式の場合のDSADへの入力電圧(volt)については、 (RX23E-A ユーザーズマニュアル　ハードウェア編 34.3.5 DSAD への入力電圧とA/D 変換結果)
//   
//  b)　Gainは、
// 　1)オーバーサンプリング比が2のべき数(DSAD1.MR0.BIT.OSR =0,1,2,3,4 or5)の場合: Gain=PGAのゲイン(GPGA)
// 　2)オーバーサンプリング比が2のべき数でない場合(DSAD0.MR0.BIT.OSR =7 として、DSAD0.OSR0で、2のべき数でない値とした場合):
//  　Gain = GPGAのゲイン(GPGA) x デジタルフィルタゲイン(GDF)
//  　GPGA = 32, GDF= 0.677626
//  　Gain = 32*0.677626 
//
//  　現在の設定: 
//     DSAD1.MR0.BIT.OSR = 5;	// オーバーサンプリング比 = 2048
//    このため Gain = PGAのゲイン = 32
//
//  2)抵抗値から温度を得る
//   抵抗と温度の対応表(pt100_table[]) より、得られた抵抗に対する温度を、直線近似で計算する。
//

void temp_cold_junction()
{
	uint16_t idx;
	float x0;
	float x1;
	float y0;
	float y1;
	
	cj_reg = 1.85892e-5f *  ad1_ch_avg[0];		// 抵抗値の計算
	
	
	idx = search_table(rtd_pt100_table,D_RTD_TABLE_SIZE, cj_reg);  // テーブル検索
	   
        x0 = rtd_pt100_table[idx];
        x1 = rtd_pt100_table[idx + 1];
   
        y0 = (float) idx + D_RTD_TABLE_TOP_TEMPARATURE;
        y1 = (float) (idx + 1) + D_RTD_TABLE_TOP_TEMPARATURE;
	
	
        cj_temp = liner_interpolate(x0, y0, x1, y1, cj_reg);  // 直線近似で温度を得る

}




// 熱電対の熱起電力
//  DSAD0のAD変換値より、入力電圧(熱起電力)を得る
// 　入力: ADカウント値
//   出力: 電圧[uV]
//
//  入力 1[mV]当たりの、DSAD0 A/Dコンバータカウント値は、429497(=8388607/19.53125) 
//   ( Vref=2.5[V], Gain=128, Vref/Gain = 2.5/128 = 19.53125 [mV], 2^23-1=8388608-1=8388607)
//    max V : 2.5[V]/128 = 0.01953125, 19.53125[mV]
//    8388607 / 19.53125 = 429,496.6784
//
float tc_thermal_motiveforce(int32_t ad_avg)
{
	float t;

	
	t =  ( ad_avg / 429496.7 ) * 1000.0;  
	
	return t;
	
}




// 熱起電力(Thermal electromotive force)から温度を得る　
//  入力:  熱起電力 [uV]
//  出力:  温度 [℃]

float thermal_motiveforce_to_temp(float emf)
{
    uint16_t idx;	
    float x0;
    float x1;
    float y0;
    float y1;
    float f_temp;
    
   
    idx = search_table(s_tc_table, D_TC_TABLE_SIZE, emf);   // 熱起電力 emfがある位置を、熱起電力表からサーチ

    x0 = s_tc_table[idx];                 // x0:Temperature range lower limit voltage [uV]   */
    x1 = s_tc_table[idx + 1];             // x1:Temperature range upper limit voltage [uV]   */

    y0 = (float) (idx + D_TC_TABLE_TOP_TEMPARATURE);        // idxの温度
    y1 = (float) ((idx + 1) + D_TC_TABLE_TOP_TEMPARATURE);  // (idx + 1)の温度

    f_temp = liner_interpolate(x0, y0, x1, y1, emf);  // 直線近似で emfの温度を得る

    return f_temp; 
    
    
	
}

// 温度から熱起電力(Thermal electromotive force)を得る
//  入力:　temp 温度 [℃]
//  出力:  熱起電力 [uV]

float temp_to_thermal_motiveforce(float temp)
{
    int32_t x0;
    int32_t x1;
    float y0;
    float y1;
    float emf;
    
    
    x0  = (int32_t) temp; 
    
    if ( temp >= 0 ) {
	    x1 = x0 + 1;
    }
    else {
	    x1 = x0 - 1;
    }
      
    y0    = s_tc_table[x0 - (int32_t) D_TC_TABLE_TOP_TEMPARATURE]; // y0:  x0[℃]の熱起電力
    y1    = s_tc_table[x1 - (int32_t) D_TC_TABLE_TOP_TEMPARATURE]; // y1:  x1   :

    emf = liner_interpolate((float) x0, y0, (float) x1, y1, temp);    // tempの熱起電力を得る 

    return emf;	
}



// 入力データのテーブル上の位置を得る。2分探索　(テーブルのデータは昇順)
// 入力:
//   * p_data_table : テーブル先頭アドレス
//     table_size   : テーブル内のデータ数
//     data         : データ
// 出力:
//     index        :データが含まれる index
//
uint16_t search_table (const float *p_data_table, uint16_t table_size, float data)
{
    uint16_t low = 0;
    uint16_t mid = 0;
    uint16_t high = 0;

   
    high    = table_size - 1;
    low     = 0;  
    
    while ((high - low) > 1)
    {
        mid = (uint16_t) ((high + low) / 2);    // テーブルの中央の位置
	
        if (p_data_table[mid] <= data)         // 入力データが中央にあるデータより大きい場合
        {
            low = mid;				// 次回は中央より、後半にあるデータを比較	       
        }
        else
        {
            high = mid;
        }
    }
    return low;
}


//  直線近似
// 抵抗値Rrtdに対する温度Trtdを直線近似で求める。
// 抵抗値をR、温度をTとすると、取得したテーブルの2点a(R1,T1)、b(R2,T2)より、Trtdを得る。
//     直線の傾き a = ( T2 - T1 ) / ( R2 - R1 )
//  Trtd = T1 + (Rrtd - R1) * a  
//

float liner_interpolate (float x0, float y0, float x1, float y1, float x)
{
    float y = 0;
    
    if (0 != (x1 - x0))
    {
        y = y0 + (((y1 - y0) * (x - x0)) / (x1 - x0));
    }
    
    return y;
}

